#+STARTIP: overview

** org-capture setup
   org-capture setup.  The fun stuff.
   
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c c") 'org-capture)

     (setq org-capture-templates
	   '(("a" "Calendar Items" entry (file+headline  "~/GoogleDrive/src/orgfiles/cal.org" "Calendar Unfiled")
	      "* %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n")
	     ("n" "Note" entry (file+headline "~/GoogleDrive/src/orgfiles/notes.org" "Notes")
	      "* %?\n%T")
	     ("l" "Link" entry (file+headline "~/GoogleDrive/src/orgfiles/links.org" "Links")
	      "* %? %^L %^g \n%T" :prepend t)
	     ("t" "To Do Item" entry (file+headline "~/GoogleDrive/src/orgfiles/i.org" "To Do Items")
	      "* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n" :prepend t)
	     ("j" "Journal" entry (file+datetree "~/GoogleDrive/src/orgfiles/journal.org")
	      "* %?\nEntered on %U\n  %i\n  %a")))
   #+END_SRC

   #+RESULTS:
   | a | Calendar Items | entry | (file+headline ~/GoogleDrive/src/orgfiles/cal.org Calendar Unfiled) | * %? |

** org-agenda
   org-agenda

   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files (list "~/GoogleDrive/src/orgfiles/cal.org"
				  "~/GoogleDrive/src/orgfiles/i.org"))

     (define-key global-map "\C-ca" 'org-agenda)

     (setq org-agenda-custom-commands
	   '(("c" "Simple agenda view"
	      ((agenda "")
	       (alltodo "")))))
   #+END_SRC

   #+RESULTS:
   | c | Simple agenda view | ((agenda ) (alltodo )) |

**** Resume Template
     #+BEGIN_SRC emacs-lisp
       (add-to-list 'org-latex-classes
		    '("resume"
		      "
       \\documentclass[letterpaper,11pt]{article}

       [NO-DEFAULT-PACKAGES]
       \\usepackage{latexsym}
       \\usepackage[empty]{fullpage}
       \\usepackage{titlesec}
       \\usepackage{marvosym}
       \\usepackage[usenames,dvipsnames]{color}
       \\usepackage{verbatim}
       \\usepackage{enumitem}
       \\usepackage[pdftex]{hyperref}
       \\usepackage{fancyhdr}

       \\pagestyle{fancy}
       \\fancyhf{} % clear all header and footer fields
       \\fancyfoot{}
       \\renewcommand{\\headrulewidth}{0pt}
       \\renewcommand{\\footrulewidth}{0pt}

       \\urlstyle{same}

       \\raggedbottom
       \\raggedright
       \\setlength{\\tabcolsep}{0in}

       \\addtolength{\\oddsidemargin}{-0.375in}
       \\addtolength{\\evensidemargin}{-0.375in}
       \\addtolength{\\textwidth}{1in}
       \\addtolength{\\topmargin}{-.5in}
       \\addtolength{\\textheight}{1.0in}

       \\titleformat{\\section}{
	 \\vspace{-4pt}\\scshape\\raggedright\\large
       }{}{0em}{}[\\color{black}\\titlerule \\vspace{-5pt}]

       \\newcommand{\\resumeItem}[2]{
	 \\item\\small{
	   \\textbf{#1}{: #2 \\vspace{-2pt}}
	 }
       }

       \\newcommand{\\resumeSubheading}[4]{
	 \\vspace{-1pt}\\item
	   \\begin{tabular*}{0.97\\textwidth}{l@{\\extracolsep{\\fill}}r}
	     \\textbf{#1} & #2 \\\\
	     \\textit{\\small#3} & \\textit{\\small #4} \\\\
	   \\end{tabular*}\\vspace{-5pt}
       }

       \\newcommand{\\resumeSubItem}[2]{\\resumeItem{#1}{#2}\\vspace{-4pt}}

       \\renewcommand{\\labelitemii}{$\\circ$}

       \\newcommand{\\resumeSubHeadingListStart}{\\begin{itemize}[leftmargin=*]}

       \\newcommand{\\resumeSubHeadingListEnd}{\\end{itemize}}

       \\newcommand{\\resumeItemListStart}{\\begin{itemize}}

       \\newcommand{\\resumeItemListEnd}{\\end{itemize}\\vspace{-5pt}}
		  "
		  ("\\section{%s}" . "\\section*{%s}")
		  ("\\resumeSubHeadingListStart{%s}" . "\\resumeSubHeadingListStart*{%s}")
		  ("\\resumeSubheading{%s}" . "\\resumeSubheading*{%s}")
		  ("\\resumeItemListStart{%s}" . "\\resumeItemListStart*{%s}")
		  ("\\resumeItem{%s}" . "\\resumeItem*{%s}"))
		)
     #+END_SRC

     #+RESULTS:
     | resume |

